АлогистикТест2/src/Catalogs/алк_ПроизводственныеКатегорииНоменклатуры/алк_ПроизводственныеКатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ПроизводственныеКатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДиапазонС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиапазонПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехПород</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сорта</name>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Породы</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Длины</name>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/алк_ПроизводственныеКатегорииНоменклатуры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ДляВсехПородПриИзменении(Элемент)
	УстановитьВидимостьПород();
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьКатегориюПоНоменклатуре();
	УстановитьВидимостьПород();
КонецПроцедуры

Процедура УстановитьВидимостьПород()
	Элементы.Породы.Видимость = не Объект.ДляВсехПород;
	Если Объект.ДляВсехПород тогда
		Объект.Породы.Очистить();
	Конецесли;
КонецПроцедуры

Процедура ЗаполнитьКатегориюПоНоменклатуре()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	Номенклатура.КатегорияНоменклатуры
	              |ИЗ
	              |	Справочник.Номенклатура КАК Номенклатура
	              |ГДЕ
	              |	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.КатегорияНоменклатуры = Выборка.КатегорияНоменклатуры;
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ЗаполнитьКатегориюПоНоменклатуре();
КонецПроцедуры
